import sqlite3
import click
from werkzeug.security import generate_password_hash
from app.db import get_db


@click.command('create-user')
@click.option('--id-employee', prompt='Employee ID', default="E0-", help='The unique employee ID.')
@click.option('--email', prompt='Email Address', default="root@zlagoda.com", help='The email address for the user.')
@click.option('--password', prompt=True, hide_input=True, default="root", confirmation_prompt=True, help='The password.')
def create_user(id_employee, email, password):
    """Register a manager user in the database."""
    db = get_db()
    cursor = db.cursor()

    hashed_password = generate_password_hash(password)

    try:
        cursor.execute(
            """INSERT INTO Employee (id_employee, empl_surname, empl_name, empl_patronymic, empl_role, salary,
                                     date_of_birth, date_of_start, phone_number, city, street, zip_code)
               VALUES (?, 'Петро', 'Іваненко', 'Васильович', 'Менеджер', 20000, '1990-01-01', '2020-01-01', '+380000000000',
                       'Київ', 'просп. Степана Бандери 1', '04101')""",
            (id_employee, )
        )
        cursor.execute(
            "INSERT INTO User (id_employee, email, password) VALUES (?, ?, ?)",
            (id_employee, email, hashed_password)
        )

        db.commit()
        click.echo(f"Successfully registered user: {email}")
    except sqlite3.IntegrityError as e:
        db.rollback()
        click.echo(f"Registration failed: {e}", err=True)
    except Exception as e:
        db.rollback()
        click.echo(f"An unexpected error occurred: {e}", err=True)

@click.command('populate-db')
def populate_database():
    conn = get_db()
    cursor = conn.cursor()

    employees = [
        ('E01', 'Мельник', 'Владислав', 'Сергійович', 'Менеджер', 25000.00, '1985-05-30', '2020-01-01', '+380971183518',
         'Київ', 'Володимира Івасюка, 12', '04205'),
        ('E02', 'Мельник', 'Ольга', 'Василівна', 'Касир', 19500.00, '1992-09-24', '2020-01-10', '+380678140192',
         'Київ', 'Північна, 15', '04210'),
        ('E03', 'Шевченко', 'Григорій', 'Олександрович', 'Касир', 15000.00, '1995-11-03', '2023-07-16',
         '+380933615711',
         'Київ', 'Червоної калини, 66', '03319'),
        ('E04', 'Бондаренко', 'Юлія', 'Анатоліївна', 'Касир', 14000.00, '1994-03-18', '2023-08-11', '+380631189156',
         'Київ', 'Верхній вал, 3', '03591'),
        ('E05', 'Кравчук', 'Олексій', None, 'Менеджер', 24000.00, '1980-08-30', '2024-05-20', '+380678813219',
         'Київ', 'Гончара, 21', '01054'),
        ('E06', 'Олійник', 'Степан', 'Віталійович', 'Касир', 15000.00, '1997-07-11', '2023-09-30', '+380936199312',
         'Київ', 'Саксаганського, 9', '04018'),
        ('E07', 'Шевчук', 'Тетяна', None, 'Касир', 14100.00, '1991-12-05', '2025-10-10', '+380713194781',
         'Київ', 'Садова, 26', '03813'),
        ('E08', 'Виговський', 'Петро', 'Михайлович', 'Касир', 13900.00, '2001-02-28', '2025-10-15', '+380679164911',
         'Київ', 'Миропільська, 33', '03189'),
        ('E09', 'Василенко', 'Ірина', 'Дмитрівна', 'Касир', 21000.00, '1987-04-14', '2020-02-23', '+380938191401',
         'Київ', 'Теодора Драйзера, 81', '03318')
    ]
    cursor.executemany("""
                       INSERT INTO Employee (id_employee, empl_surname, empl_name, empl_patronymic, empl_role, salary,
                                             date_of_birth, date_of_start, phone_number, city, street, zip_code)
                       VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
                       """, employees)

    hashed_password = generate_password_hash('root')
    users = [
        ('E01', 'v.melnyk@zlagoda.com', hashed_password),
        ('E02', 'o.melnyk@zlagoda.com', hashed_password),
        ('E03', 'g.shevchenko@zlagoda.com', hashed_password)
    ]
    cursor.executemany("INSERT INTO User (id_employee, email, password) VALUES (?, ?, ?)", users)

    categories = [
        (None, 'Молочні продукти'),
        (None, 'Хлібобулочні вироби'),
        (None, 'Напої'),
        (None, 'Бакалія'),
        (None, 'Кондитерські вироби'),
        (None, 'М\'ясні продукти'),
        (None, 'Риба та морепродукти'),
    ]
    cursor.executemany("INSERT INTO Category (category_number, category_name) VALUES (?, ?)", categories)

    products = [
        (None, 2, 'Хліб Житній, 500г', 'Київхліб', 'Хліб житньо-пшеничний, цільно-зерновий, вага 500г.'),
        (None, 2, 'Батон, 450г', 'Київхліб', 'Пшеничний хліб нарізаний скибками, вага 450г.'),
        (None, 1, 'Молоко 2.5%, 900мл', 'Селянське',
         'Пастеризоване коров\'яче молоко, питне, 2.5% жиру, об\'єм 900 мл.'),
        (None, 4, 'Спагеті, 500г', 'Ярослав', 'Макарони спагеті з твердих сортів пшениці, вага 500г.'),
        (None, 4, 'Гречка, 1кг', 'Розумний вибір', 'Гречка, вага 1кг.'),
        (None, 3, 'Сік Мультивітамін, 1л', 'Сандора', 'Пакування ТетраПак, об\'єм 1л.'),
        (None, 1, 'Йогурт питний, 290г', 'Галичина',
         'Йогурт зі смаком вишні, жирність 1.5%, пластикова пляшка 290г. Може містити кісточки'),
        (None, 3, 'Вода мінеральна, 0.5л', 'Моршинська', 'Вода негазована, пластикова пляшка, об\'єм 0.5л.'),
        (None, 5, 'Шоколад молочний, 90г', 'Мілка', 'Молочний шоколад, вага 90г.'),
        (None, 6, 'Філе курки, 1кг', 'Наша ряба', 'Філе куряче, лоток, вага 1кг.'),
        (None, 5, 'Печиво вівсяне, 300г', 'Своя лінія', 'Вівсяне печиво з родзинками, вага 300г.'),
    ]
    cursor.executemany(
        "INSERT INTO Product (id_product, category_number, product_name, producer_name, characteristics) VALUES (?, ?, ?, ?, ?)",
        products)

    store_products = [
        ('111111111112', None, 3, 28.40, 5, 1),
        ('111111111122', None, 7, 24.00, 10, 1),
        ('111111111131', None, 2, 22.00, 50, 0),
        ('111111111141', None, 1, 26.00, 30, 0),
        ('111111111151', None, 6, 60.00, 25, 0),
        ('111111111161', None, 8, 18.00, 100, 0),
        ('111111111171', None, 4, 45.00, 35, 0),
        ('111111111181', None, 5, 55.00, 40, 0),
        ('111111111191', None, 9, 45.00, 60, 0),
        ('111111111201', None, 11, 32.00, 40, 0),
        ('111111111212', None, 10, 120.00, 5, 0),
    ]
    cursor.executemany("""
                       INSERT INTO Store_Product (UPC, UPC_prom, id_product, selling_price, products_number,
                                                  promotional_product)
                       VALUES (?, ?, ?, ?, ?, ?)
                       """, store_products)

    store_products_prom = [
        ('111111111111', '111111111112', 3, 35.50, 10, 0),
        ('111111111121', '111111111122', 7, 30.00, 20, 0),
        ('111111111211', '111111111212', 10, 150.00, 10, 0),
    ]

    cursor.executemany("""
                       INSERT INTO Store_Product (UPC, UPC_prom, id_product, selling_price, products_number,
                                                  promotional_product)
                       VALUES (?, ?, ?, ?, ?, ?)
                       """, store_products_prom)

    customer_cards = [
        ('C000000000001', 'Шевченко', 'Владислав', 'Сергійович', '+380971183518', None, None, None, 10),
        ('C000000000002', 'Мельник', 'Ольга', 'Василівна', '+380678140192', 'Київ', 'Північна, 15', '04210', 5),
        ('C000000000003', 'Мельник', 'Григорій', 'Олександрович', '+380933615711', 'Київ', 'Червоної калини, 66',
         '03319', 3),
        ('C000000000004', 'Бондаренко', 'Юлія', 'Анатоліївна', '+380631189156', None, None, None, 12),
        ('C000000000005', 'Кравчук', 'Олексій', None, '+380678813219', None, None, None, 15),
        ('C000000000006', 'Олійник', 'Степан', 'Віталійович', '+380936199312', None, None, None, 7),
        ('C000000000007', 'Шевчук', 'Тетяна', None, '+380713194781', None, None, None, 10),
        ('C000000000008', 'Виговський', 'Петро', 'Михайлович', '+380679164911', 'Київ', 'Грушевського, 5', '03517', 5),
    ]
    cursor.executemany("""
                       INSERT INTO Customer_Card (card_number, cust_surname, cust_name, cust_patronymic, phone_number,
                                                  city, street, zip_code, percent)
                       VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
                       """, customer_cards)

    checks = [
        ('CH00000001', 'E02', 'C000000000001', '2026-01-01 10:00:00', 83.70, 16.74),
        ('CH00000002', 'E03', None, '2026-01-01 11:30:00', 148.40, 29.68),
        ('CH00000003', 'E04', 'C000000000002', '2026-01-02 14:15:00', 167.20, 33.44),
        ('CH00000004', 'E06', 'C000000000003', '2026-01-02 16:40:00', 52.38, 10.48),
        ('CH00000005', 'E07', 'C000000000004', '2026-01-03 09:10:00', 105.60, 21.12),
        ('CH00000006', 'E08', None, '2026-01-03 12:20:00', 145.00, 29.00),
        ('CH00000007', 'E09', 'C000000000005', '2026-01-04 15:45:00', 181.90, 36.38),
        ('CH00000008', 'E02', 'C000000000006', '2026-01-04 17:30:00', 83.70, 16.74),
        ('CH00000009', 'E03', None, '2026-01-05 11:00:00', 72.90, 14.58),
        ('CH00000010', 'E04', None, '2026-01-05 13:50:00', 150.00, 30.00),
        ('CH00000011', 'E06', None, '2026-01-06 10:20:00', 53.96, 10.79),
        ('CH00000012', 'E07', None, '2026-01-06 15:40:00', 112.00, 22.40),
        ('CH00000013', 'E08', 'C000000000001', '2026-01-07 11:15:00', 90.00, 18.00),
        ('CH00000014', 'E09', 'C000000000002', '2026-01-07 14:30:00', 85.50, 17.10),
        ('CH00000015', 'E02', None, '2026-01-08 17:50:00', 80.00, 16.00),
        ('CH00000016', 'E03', 'C000000000003', '2026-01-09 09:45:00', 145.50, 29.10),
        ('CH00000017', 'E04', 'C000000000004', '2026-01-09 13:00:00', 79.20, 15.84),
        ('CH00000018', 'E06', None, '2026-01-10 16:15:00', 120.00, 24.00),
        ('CH00000019', 'E07', 'C000000000005', '2026-01-10 18:30:00', 88.40, 17.68),
        ('CH00000020', 'E08', None, '2026-01-11 12:00:00', 83.70, 16.74),
        ('CH00000021', 'E09', None, '2026-01-11 14:45:00', 105.00, 21.00),
        ('CH00000022', 'E02', 'C000000000007', '2026-01-12 11:20:00', 87.30, 17.46),
        ('CH00000023', 'E03', 'C000000000008', '2026-01-12 15:10:00', 82.65, 16.53),
        ('CH00000024', 'E04', None, '2026-01-13 16:35:00', 142.00, 28.40),
        ('CH00000025', 'E06', 'C000000000001', '2026-01-13 19:00:00', 135.00, 27.00),
        ('CH00000026', 'E07', 'C000000000002', '2026-01-14 10:10:00', 114.00, 22.80),
        ('CH00000027', 'E08', None, '2026-01-14 13:40:00', 81.00, 16.20),
        ('CH00000028', 'E09', 'C000000000003', '2026-01-15 11:15:00', 83.42, 16.68),
        ('CH00000029', 'E02', None, '2026-01-15 15:55:00', 171.60, 34.32),
        ('CH00000030', 'E03', None, '2026-01-16 17:00:00', 69.00, 13.80)
    ]
    cursor.executemany("""
                       INSERT INTO "Check" (check_number, id_employee, card_number, print_date, sum_total, vat)
                       VALUES (?, ?, ?, ?, ?, ?)
                       """, checks)

    sales = [
        # CH00000001
        ('111111111111', 'CH00000001', 2, 35.50),
        ('111111111131', 'CH00000001', 1, 22.00),
        # CH00000002
        ('111111111112', 'CH00000002', 1, 28.40),
        ('111111111151', 'CH00000002', 2, 60.00),
        # CH00000003
        ('111111111211', 'CH00000003', 1, 150.00),
        ('111111111141', 'CH00000003', 1, 26.00),
        # CH00000004
        ('111111111161', 'CH00000004', 3, 18.00),
        # CH00000005
        ('111111111191', 'CH00000005', 2, 45.00),
        ('111111111121', 'CH00000005', 1, 30.00),
        # CH00000006
        ('111111111171', 'CH00000006', 2, 45.00),
        ('111111111181', 'CH00000006', 1, 55.00),
        # CH00000007
        ('111111111211', 'CH00000007', 1, 150.00),
        ('111111111201', 'CH00000007', 2, 32.00),
        # CH00000008
        ('111111111122', 'CH00000008', 1, 24.00),
        ('111111111131', 'CH00000008', 3, 22.00),
        # CH00000009
        ('111111111171', 'CH00000009', 1, 45.00),
        ('111111111161', 'CH00000009', 2, 18.00),
        # CH00000010
        ('111111111211', 'CH00000010', 1, 150.00),
        # CH00000011
        ('111111111112', 'CH00000011', 2, 28.40),
        # CH00000012
        ('111111111151', 'CH00000012', 1, 60.00),
        ('111111111141', 'CH00000012', 2, 26.00),
        # CH00000013
        ('111111111181', 'CH00000013', 1, 55.00),
        ('111111111191', 'CH00000013', 1, 45.00),
        # CH00000014
        ('111111111121', 'CH00000014', 3, 30.00),
        # CH00000015
        ('111111111201', 'CH00000015', 1, 32.00),
        ('111111111122', 'CH00000015', 2, 24.00),
        # CH00000016
        ('111111111211', 'CH00000016', 1, 150.00),
        # CH00000017
        ('111111111191', 'CH00000017', 2, 45.00),
        # CH00000018
        ('111111111212', 'CH00000018', 1, 120.00),
        # CH00000019
        ('111111111151', 'CH00000019', 1, 60.00),
        ('111111111131', 'CH00000019', 2, 22.00),
        # CH00000020
        ('111111111161', 'CH00000020', 5, 18.00),
        # CH00000021
        ('111111111171', 'CH00000021', 1, 45.00),
        ('111111111121', 'CH00000021', 2, 30.00),
        # CH00000022
        ('111111111111', 'CH00000022', 2, 35.50),
        ('111111111141', 'CH00000022', 1, 26.00),
        # CH00000023
        ('111111111181', 'CH00000023', 1, 55.00),
        ('111111111201', 'CH00000023', 1, 32.00),
        # CH00000024
        ('111111111212', 'CH00000024', 1, 120.00),
        ('111111111131', 'CH00000024', 1, 22.00),
        # CH00000025
        ('111111111211', 'CH00000025', 1, 150.00),
        # CH00000026
        ('111111111151', 'CH00000026', 2, 60.00),
        # CH00000027
        ('111111111191', 'CH00000027', 1, 45.00),
        ('111111111161', 'CH00000027', 2, 18.00),
        # CH00000028
        ('111111111121', 'CH00000028', 2, 30.00),
        ('111111111141', 'CH00000028', 1, 26.00),
        # CH00000029
        ('111111111211', 'CH00000029', 1, 150.00),
        ('111111111171', 'CH00000029', 1, 45.00),
        # CH00000030
        ('111111111122', 'CH00000030', 1, 24.00),
        ('111111111191', 'CH00000030', 1, 45.00)
    ]
    cursor.executemany("""
                       INSERT INTO Sale (UPC, check_number, product_number, selling_price)
                       VALUES (?, ?, ?, ?)
                       """, sales)

    conn.commit()

    click.echo("Database successfully populated with data.")
